## SQLQuery2_1.sql

In [ ]:
use TestDB1;

go
create view PR10
as 
select
    name,
	capital,
	square,
	population,
	continent
from Countries
where 
	population>10000000
	and
	square>500000
	and 
	continent=N'Африка'
go 
select
	*
from PR10

## SQLQuery2_2.sql

In [ ]:
use TestDB1;

go
create view PR200
(
   Kontinent,
	Sr_PL,
	Sr_KolNas
)
as
select
    continent,
    avg(square) as Sr_PL,
	round(avg(cast(population as float) / square), 0) as Sr_KolNas
from Countries
group by
   continent
go 
select
   *
from PR200

## SQLQuery2_3.sql

In [ ]:
use TestDatabas;

go 
create view PR330
(
   Surname,
   Job,
   Title,
   Degree,
   Workplace,
   [Exams Number]
 )
 as select
    FIO,
  Dolgn,
  Zvanie,
  Stepen,
  ShifrKaf_Sotr,
  (select count(distinct o.kod) from ozenka o where O.Tab_Nom = C.TabNom) as [Exams Number]
  From
  Sotrudnik C
  inner join Prepodavatel P on C.TabNom=P.TabNom_Pr
  inner join Kafedra K on C.ShifrKaf_Sotr=K.ShifrKaf
go
select
   *
   from PR330

## SQLQuery2_4.sql

In [ ]:
DECLARE @MonthTable TABLE (
    MonthNumber INT,
    MonthName VARCHAR(20),
    DaysInMonth INT
);

DECLARE @year INT = YEAR(GETDATE());
DECLARE @month INT = 1;
WHILE @month <= 12
BEGIN
    INSERT INTO @MonthTable (MonthNumber, MonthName, DaysInMonth)
    VALUES (
        @month,
        DATENAME(MONTH, DATEFROMPARTS(@year, @month, 1)),
        DAY(EOMONTH(DATEFROMPARTS(@year, @month, 1)))
    );
    SET @month = @month + 1;
END

SELECT * FROM @MonthTable;

## SQLQuery2_5.sql

In [ ]:
use TestDB1;

declare @PR5 Table
(
   Name varchar(50),
   Capital varchar(50),
   Square float,
   Population bigint,
   Continent varchar(50)
)
insert into @PR5
  select 
    name,
    capital,
    population,
    square,
    continent
  from Countries A
where square*100 < (select avg(square) from Countries B where A.continent = B.continent)
select
   Name,
   Capital,
   Square,
   Population,
   Continent
 from @PR5

## SQLQuery2_6.sql

In [ ]:
use TestDatabas;

select
DATENAME(week, data) as [Week Name],
count(distinct Kod) as [Exams Number],
count(distinct RegNom) as [Students Number] into
  #PR26
from Ozenka
group by
  DATENAME(week, data)
select * from #PR26

## SQLQuery2_7.sql

In [ ]:
use TestDB1;

create table ##PR7
(
   Name varchar(50),
   MaxSquare int,
   MinSquare int
)
insert into
   ##PR700
   (Name, MaxSquare,MinSquare)
select
continent,
max(square)as MaxSquare,
min(square)as MinSquare
from
  Countries
group by
  continent
select*from ##PR700

## SQLQuery2_8.sql

In [ ]:
use TestDatabas;

with AverageFacultySalary as
(
select
    F.NFak as Faculty,
	F.ABFak,
	avg(Zarplata) as [Average salary] 
from Sotrudnik C
	inner join Kafedra K on C.ShifrKaf_Sotr=K.ShifrKaf
	inner join Fakultet F on F.ABFak = K.AbFak_Kaf
group by
	F.NFak, F.ABFak
)
select
   C.FIO,
   C.Zarplata,
   AFS.Faculty,
   AFS.[Average salary]
from
   Sotrudnik C
   inner join Kafedra K on C.ShifrKaf_Sotr = K.ShifrKaf
   inner join AverageFacultySalary AFS on AFS.ABFak = K.AbFak_Kaf
where
   C.Zarplata<AFS.[Average salary]

## SQLQuery2_9.sql

In [ ]:
use TestDB1
drop view PR10
drop view PR200
drop table PR5
drop table PR7

use TestDatabas
drop view PR330
drop table MonthTable
drop table #PR6
drop table #PR26